In [4]:
import pandas as pd

In [6]:
data = {
    'Nombre': ['Ana', 'Luis', 'Carlos', 'Sara'],
    'Edad': [25, 30, 22, 27],
    'Ciudad': ['Madrid', 'Barcelona', 'Valencia', 'Bilbao']
}

df = pd.DataFrame(data)

In [8]:
df

   Nombre  Edad     Ciudad
0     Ana    25     Madrid
1    Luis    30  Barcelona
2  Carlos    22   Valencia
3    Sara    27     Bilbao

In [10]:
df['Salario'] =[30000,45000,38000,32000,] #Si no existe se agrega una nueva serie
df

   Nombre  Edad     Ciudad  Salario
0     Ana    25     Madrid    30000
1    Luis    30  Barcelona    45000
2  Carlos    22   Valencia    38000
3    Sara    27     Bilbao    32000

In [12]:
df["Salario"] = df["Salario"] + 2000
df

   Nombre  Edad     Ciudad  Salario
0     Ana    25     Madrid    32000
1    Luis    30  Barcelona    47000
2  Carlos    22   Valencia    40000
3    Sara    27     Bilbao    34000

In [16]:
nombres = df["Nombre"]
nombres

0       Ana
1      Luis
2    Carlos
3      Sara
Name: Nombre, dtype: object

In [18]:
mayores_25 = df[df["Edad"] > 25]
mayores_25

  Nombre  Edad     Ciudad  Salario
1   Luis    30  Barcelona    47000
3   Sara    27     Bilbao    34000

In [20]:
edades = df["Edad"]
edades

0    25
1    30
2    22
3    27
Name: Edad, dtype: int64

In [30]:
mayores_25 = df[edades > 25]
mayores_25

  Nombre  Edad     Ciudad  Salario
1   Luis    30  Barcelona    47000
3   Sara    27     Bilbao    34000

In [32]:
type(df)

pandas.core.frame.DataFrame

In [36]:
type(edades)

pandas.core.series.Series

In [38]:
type(mayores_25)

pandas.core.frame.DataFrame